<a href="https://github.com/dannyk81"><img src="https://avatars0.githubusercontent.com/u/24274156?v=4" align="left" width="48" height="48" hspace="10"></img></a> **Comment by [dannyk81](https://github.com/dannyk81)**
_Wednesday Nov 06, 2019 at 20:38 GMT_

----

haa, indeed the `ForceNew: true` is already there...

I just did a quick test and in my case the VS resource is indeed being recreated when changing the `name`:

```diff
 resource "bigip_ltm_virtual_server" "https" {
-  name        = "/Common/vs_bar"
+  name        = "/Common/vs_foo"
   destination = "1.2.3.4"
   ip_protocol = "tcp"
   port        = 8080
   pool        = bigip_ltm_pool.test_pool1.name
 }
```

```
  # bigip_ltm_virtual_server.https must be replaced
-/+ resource "bigip_ltm_virtual_server" "https" {
      ~ client_profiles              = [] -> (known after apply)
        destination                  = "1.2.3.4"
      + fallback_persistence_profile = (known after apply)
      ~ id                           = "/Common/vs_bar" -> (known after apply)
        ip_protocol                  = "tcp"
      - irules                       = [] -> null
        mask                         = "255.255.255.255"
      ~ name                         = "/Common/vs_bar" -> "/Common/vs_foo" # forces replacement
      ~ persistence_profiles         = [] -> (known after apply)
      - policies                     = [] -> null
        pool                         = "/Common/test_pool1"
        port                         = 8080
      ~ profiles                     = [
          - "/Common/fastL4",
        ] -> (known after apply)
      ~ server_profiles              = [] -> (known after apply)
      + snatpool                     = (known after apply)
        source                       = "0.0.0.0/0"
      ~ source_address_translation   = "none" -> (known after apply)
        state                        = "enabled"
      ~ translate_address            = "enabled" -> (known after apply)
      ~ translate_port               = "enabled" -> (known after apply)
      - vlans                        = [] -> null
      ~ vlans_enabled                = false -> (known after apply)
    }
```

and here's the apply itself:
```
bigip_ltm_virtual_server.https: Destroying... [id=/Common/vs_bar]
bigip_ltm_virtual_server.https: Destruction complete after 0s
bigip_ltm_virtual_server.https: Creating...
bigip_ltm_virtual_server.https: Creation complete after 2s [id=/Common/vs_foo]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```

just curious, which version of terraform are you using?
